create user flow
